/**
 * @file  GetTime.h
 * @brief 現在日時取得 ヘッダーファイル
 * @author screen
 * @date  20210720 screen 新規作成
 **/
#pragma once

/**
 * @brief 現在日時取得クラス
*/
class CGetTime
{
	public:
		/**
		* @brief 2009:12:21:04:45:47 の形式で現在の日時を取得する
		* @return 「2009:12:21:04:45:47」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrTimeCo
		// --------------------------------------------------------------------------
		// CString : 2009:12:21:04:45:47 の形で現在の日時を取得する
		static CString GetStrTimeCo();

		/**
		* @brief 20091221044547 の形式で現在の日時を取得する
		* @return 「20091221044547」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrTime
		// --------------------------------------------------------------------------
		// CString : 20091221044547 の形で現在の日時を取得する
		static CString GetStrTime();

		/**
		* @brief 20091221044547 の形式で現在の日時を取得する
		* @return 「20091221044547」形式のint型の数値
		*/
		// --------------------------------------------------------------------------
		//		GetIntTime
		// --------------------------------------------------------------------------
		// int : 20091221044547 の形で現在の日時をint型で取得する
		static int GetIntTime();
		
		/**
		* @brief 2009/12/21/04/45/47 の形式で現在の日時を取得する
		* @return 「2009/12/21/04/45/47」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrTimeSla
		// --------------------------------------------------------------------------
		// CString : 2009/12/21/04/45/47 の形で現在の日時を取得する
		static CString GetStrTimeSla();

		/**
		* @brief 2009/12/21 04:45:47 の形式で現在の日時を取得する
		* @return 「2009/12/21 04:45:47」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrTimeSlCo
		// --------------------------------------------------------------------------
		// CString : 2009/12/21 04:45:47 の形で現在の日時を取得する
		static CString GetStrTimeSlCo();

		/**
		* @brief 2009:12:21 の形式で現在の日付を取得する
		* @return 「2009:12:21」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrDateCo
		// --------------------------------------------------------------------------
		// CString : 2009:12:21 の形で現在の日付を取得する
		static CString GetStrDateCo();

		/**
		* @brief 20091221 の形式で現在の日付を取得する
		* @return 「20091221」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrDate
		// --------------------------------------------------------------------------
		// CString : 20091221 の形で現在の日付を取得する
		static CString GetStrDate();

		/**
		* @brief 20091221 の形式で現在の日付を取得する
		* @return 「20091221」形式のint型の数値
		*/
		// --------------------------------------------------------------------------
		//		GetIntDate
		// --------------------------------------------------------------------------
		// int : 20091221 の形で現在の日付をint型で取得する
		static int GetIntDate();
		
		/**
		* @brief 2009/12/21 の形式で現在の日付を取得する
		* @return 「2009/12/21」形式の文字列
		*/
		// --------------------------------------------------------------------------
		//		GetStrDateSla
		// --------------------------------------------------------------------------
		// CString : 2009/12/21 の形で現在の日付を取得する
		static CString GetStrDateSla();
};