/**
 * @file  ServerThread.h
 * @brief UWからの要求受信スレッド ヘッダーファイル
 * @author screen
 * @date  20211119 screen 新規作成
 **/
#pragma once

/**
* @brief JI JMF通信 JMFを受信するスレッド
*/
class CWriteDebugLog;
class CServerThread
{
public:
	/* ==================================================================================================== */
	/**
		* @brief  CServerThread コンストラクション
	**/
	/* ==================================================================================================== */
	CServerThread();

	/* ==================================================================================================== */
	/**
		* @brief  CServerThread デストラクション
	**/
	/* ==================================================================================================== */
	virtual ~CServerThread();

	/* ==================================================================================================== */
	/**
		* @brief  スレッドを起動する
		* @param  pParent       　: [i]親画面のウィンドウハンドル
		* @retval スレッドＩＤ
	**/
	/* ==================================================================================================== */
	UINT	Start( CWnd* pParent );

	/* ==================================================================================================== */
	/**
		* @brief  受信スレッド
		* @param  pData : [i]CServerThreadのポインタ
		* @retval 0(固定)
	**/
	/* ==================================================================================================== */
	HANDLE	GetThreadHandle() { return m_hThread; }

private:
	static UINT __stdcall ThreadFunction( void* pData );

public:
	CWnd*				m_pParent;				//!< スレッド呼び出し側クラス
	HANDLE				m_hThread;				//!< スレッドハンドル
	CWriteDebugLog*		m_pWriteLog;			//!< ログクラスのポインタ
};