/**
 * @file  Client.h
 * @brief UWへJMFを送信 ヘッダーファイル
 * @author screen
 * @date  20210720 screen 新規作成
 **/
#pragma once

#include "CommonNet.h"

/**
* JI JMF通信 JMF送信クラス
* 共通部分のメソッド
* @brief JI JMF通信 JMF送信クラス
*/
class CClient
{
public:
	/* ==================================================================================================== */
	/**
		* @brief  CClient コンストラクション
	**/
	/* ==================================================================================================== */
	CClient();

	/* ==================================================================================================== */
	/**
		* @brief  CClient デストラクション
	**/
	/* ==================================================================================================== */
	virtual ~CClient();

	/* ==================================================================================================== */
	/**
		* @brief JMFを送信する
		* @param  pParent		: [i]親クラスのポインタ
		* @param  nJmfType		: [i]送信JMF種別
		* @param  pWriteLog		: [i]ログクラスポインタ
	**/
	/* ==================================================================================================== */
	BOOL HttpClientMain( CWnd* pParent, UINT nJmfType, CWriteDebugLog* pWriteLog );

private:
	/* ==================================================================================================== */
	/**
		* @brief タグの値を変更
		* @param  nJmfType		: [i]送信JMF種別
		* @param  SourceJmf		: [i]変更前のJMFデータ
		* @retval タグを値に変更したJMFデータ
	**/
	/* ==================================================================================================== */
	CString TagConversion( UINT nJmfType, const CString& SourceJmf );
};